landracer/opendash/mos-4ch-a-pre-restore-2026-05-24/sdkconfig.defaults
# ─────────────────────────────────────────────────────────────────────────────
# OpenDash 4-Channel MOS FET A — SDK Configuration Defaults
#
# NOTE: Standard ESP32 (not ESP32-S3).
# GPIO assignments TBD — requires physical pinout discovery.
# ─────────────────────────────────────────────────────────────────────────────

CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# CPU
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# Brownout — DISABLED for FTDI-powered development
CONFIG_ESP_BROWNOUT_DET=n

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
